Revit 2027 API
PathReinforcement.AdditionalOffset Property
 Additional offset of rebars in the Path Reinforcement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AdditionalOffset { get; set; }
Public Property AdditionalOffset As Double
	Get
	Set
public:
property double AdditionalOffset {
	double get ();
	void set (double value);
}
member AdditionalOffset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for offset must be no more than 30000 feet in absolute value.
Remarks
 The method moves both primary and alternating bars.
See Also
Reference
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace